<a href="https://colab.research.google.com/github/ksh001/ksh0011/blob/main/py_pd_01.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
import pandas as pd
df1 = pd.DataFrame(# 괄호 아래로 보내면 오류남
     {
         'a' : [1, 2, 3],
         'b' : [4, 5, 6],
          'c' : [7, 8, 9]
      },
     index = ['aa','bb','cc']
      )

df1

    a  b  c
aa  1  4  7
bb  2  5  8
cc  3  6  9

In [2]:
import pandas as pd
df2 = pd.DataFrame(# 괄호 아래로 보내면 오류남
     {'a' : [1, 2, 3, 0],
      'b' : [4, 5, 3, 6],
      'c' : [7, 8, 9, 0]},
      index = ['A','B','C','D']
      )

df2

   a  b  c
A  1  4  7
B  2  5  8
C  3  3  9
D  0  6  0

In [3]:
df3 = pd.DataFrame(
    {'a' : [1, 2, 3],
     'b' : [4, 5, 6],
     'c' : [7, 8, 9]},
 index = pd.MultiIndex.from_tuples(
     [('D','l'), ('D','m'), ('E','n')],
     names = ['d', 'e']
     )
 )

df3

     a  b  c
d e
D l  1  4  7
  m  2  5  8
E n  3  6  9

In [ ]:
pd.melt(df1)

  variable  value
0        a      1
1        a      2
2        a      3
3        b      4
4        b      5
5        b      6
6        c      7
7        c      8
8        c      9

In [ ]:
pd.concat([df1,df2])

    a  b  c
aa  1  4  7
bb  2  5  8
cc  3  6  9
A   1  4  7
B   2  5  8
C   3  3  9
D   0  6  0